DovPearX/vesc_express/sdkconfig.defaults.esp32s3_fh4
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) 6.0.2 Project Configuration
#
# default:
CONFIG_SOC_ADC_SUPPORTED=y
# default:
CONFIG_SOC_UART_SUPPORTED=y
# default:
CONFIG_SOC_PCNT_SUPPORTED=y
# default:
CONFIG_SOC_PHY_SUPPORTED=y
# default:
CONFIG_SOC_WIFI_SUPPORTED=y
# default:
CONFIG_SOC_TWAI_SUPPORTED=y
# default:
CONFIG_SOC_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_UHCI_SUPPORTED=y
# default:
CONFIG_SOC_AHB_GDMA_SUPPORTED=y
# default:
CONFIG_SOC_GPTIMER_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_CAM_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_I80_LCD_SUPPORTED=y
# default:
CONFIG_SOC_LCDCAM_RGB_LCD_SUPPORTED=y
# default:
CONFIG_SOC_LCD_I80_SUPPORTED=y
# default:
CONFIG_SOC_LCD_RGB_SUPPORTED=y
# default:
CONFIG_SOC_MCPWM_SUPPORTED=y
# default:
CONFIG_SOC_DEDICATED_GPIO_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_SUPPORT_WRAP=y
# default:
CONFIG_SOC_ULP_SUPPORTED=y
# default:
CONFIG_SOC_ULP_FSM_SUPPORTED=y
# default:
CONFIG_SOC_RISCV_COPROC_SUPPORTED=y
# default:
CONFIG_SOC_BT_SUPPORTED=y
# default:
CONFIG_SOC_USB_OTG_SUPPORTED=y
# default:
CONFIG_SOC_USB_SERIAL_JTAG_SUPPORTED=y
# default:
CONFIG_SOC_CCOMP_TIMER_SUPPORTED=y
# default:
CONFIG_SOC_ASYNC_MEMCPY_SUPPORTED=y
# default:
CONFIG_SOC_SUPPORTS_SECURE_DL_MODE=y
# default:
CONFIG_SOC_EFUSE_KEY_PURPOSE_FIELD=y
# default:
CONFIG_SOC_EFUSE_SUPPORTED=y
# default:
CONFIG_SOC_SDMMC_HOST_SUPPORTED=y
# default:
CONFIG_SOC_RTC_FAST_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_SLOW_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_MEM_SUPPORTED=y
# default:
CONFIG_SOC_RTC_TIMER_V1_SUPPORTED=y
# default:
CONFIG_SOC_PSRAM_DMA_CAPABLE=y
# default:
CONFIG_SOC_XT_WDT_SUPPORTED=y
# default:
CONFIG_SOC_I2S_SUPPORTED=y
# default:
CONFIG_SOC_RMT_SUPPORTED=y
# default:
CONFIG_SOC_SDM_SUPPORTED=y
# default:
CONFIG_SOC_GPSPI_SUPPORTED=y
# default:
CONFIG_SOC_LEDC_SUPPORTED=y
# default:
CONFIG_SOC_I2C_SUPPORTED=y
# default:
CONFIG_SOC_SYSTIMER_SUPPORTED=y
# default:
CONFIG_SOC_SUPPORT_COEXISTENCE=y
# default:
CONFIG_SOC_TEMP_SENSOR_SUPPORTED=y
# default:
CONFIG_SOC_AES_SUPPORTED=y
# default:
CONFIG_SOC_MPI_SUPPORTED=y
# default:
CONFIG_SOC_SHA_SUPPORTED=y
# default:
CONFIG_SOC_HMAC_SUPPORTED=y
# default:
CONFIG_SOC_DIG_SIGN_SUPPORTED=y
# default:
CONFIG_SOC_FLASH_ENC_SUPPORTED=y
# default:
CONFIG_SOC_SECURE_BOOT_SUPPORTED=y
# default:
CONFIG_SOC_MEMPROT_SUPPORTED=y
# default:
CONFIG_SOC_TOUCH_SENSOR_SUPPORTED=y
# default:
CONFIG_SOC_BOD_SUPPORTED=y
# default:
CONFIG_SOC_CLK_TREE_SUPPORTED=y
# default:
CONFIG_SOC_MPU_SUPPORTED=y
# default:
CONFIG_SOC_WDT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_FLASH_SUPPORTED=y
# default:
CONFIG_SOC_RNG_SUPPORTED=y
# default:
CONFIG_SOC_LIGHT_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_DEEP_SLEEP_SUPPORTED=y
# default:
CONFIG_SOC_LP_PERIPH_SHARE_INTERRUPT=y
# default:
CONFIG_SOC_PM_SUPPORTED=y
# default:
CONFIG_SOC_SIMD_INSTRUCTION_SUPPORTED=y
# default:
CONFIG_SOC_XTAL_SUPPORT_40M=y
# default:
CONFIG_SOC_APPCPU_HAS_CLOCK_GATING_BUG=y
# default:
CONFIG_SOC_ADC_RTC_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DIG_CTRL_SUPPORTED=y
# default:
CONFIG_SOC_ADC_ARBITER_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DIG_IIR_FILTER_SUPPORTED=y
# default:
CONFIG_SOC_ADC_MONITOR_SUPPORTED=y
# default:
CONFIG_SOC_ADC_DMA_SUPPORTED=y
# default:
CONFIG_SOC_ADC_PERIPH_NUM=2
# default:
CONFIG_SOC_ADC_MAX_CHANNEL_NUM=10
# default:
CONFIG_SOC_ADC_ATTEN_NUM=4
# default:
CONFIG_SOC_ADC_DIGI_CONTROLLER_NUM=2
# default:
CONFIG_SOC_ADC_PATT_LEN_MAX=24
# default:
CONFIG_SOC_ADC_DIGI_MIN_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_DIGI_RESULT_BYTES=4
# default:
CONFIG_SOC_ADC_DIGI_DATA_BYTES_PER_CONV=4
# default:
CONFIG_SOC_ADC_DIGI_IIR_FILTER_NUM=2
# default:
CONFIG_SOC_ADC_DIGI_MONITOR_NUM=2
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_HIGH=83333
# default:
CONFIG_SOC_ADC_SAMPLE_FREQ_THRES_LOW=611
# default:
CONFIG_SOC_ADC_RTC_MIN_BITWIDTH=12
# default:
CONFIG_SOC_ADC_RTC_MAX_BITWIDTH=12
# default:
CONFIG_SOC_ADC_CALIBRATION_V1_SUPPORTED=y
# default:
CONFIG_SOC_ADC_SELF_HW_CALI_SUPPORTED=y
# default:
CONFIG_SOC_ADC_SHARED_POWER=y
# default:
CONFIG_SOC_APB_BACKUP_DMA=y
# default:
CONFIG_SOC_BROWNOUT_RESET_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_WRITEBACK_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_FREEZE_SUPPORTED=y
# default:
CONFIG_SOC_CACHE_ACS_INVALID_STATE_ON_PANIC=y
# default:
CONFIG_SOC_CPU_CORES_NUM=2
# default:
CONFIG_SOC_CPU_INTR_NUM=32
# default:
CONFIG_SOC_CPU_HAS_FPU=y
# default:
CONFIG_SOC_HP_CPU_HAS_MULTIPLE_CORES=y
# default:
CONFIG_SOC_CPU_BREAKPOINTS_NUM=2
# default:
CONFIG_SOC_CPU_WATCHPOINTS_NUM=2
# default:
CONFIG_SOC_CPU_WATCHPOINT_MAX_REGION_SIZE=0x40
# default:
CONFIG_SOC_SIMD_PREFERRED_DATA_ALIGNMENT=16
# default:
CONFIG_SOC_DS_SIGNATURE_MAX_BIT_LEN=4096
# default:
CONFIG_SOC_DS_KEY_PARAM_MD_IV_LENGTH=16
# default:
CONFIG_SOC_DS_KEY_CHECK_MAX_WAIT_US=1100
# default:
CONFIG_SOC_AHB_GDMA_VERSION=1
# default:
CONFIG_SOC_GPIO_PORT=1
# default:
CONFIG_SOC_GPIO_PIN_COUNT=49
# default:
CONFIG_SOC_GPIO_SUPPORT_PIN_GLITCH_FILTER=y
# default:
CONFIG_SOC_GPIO_SUPPORT_FORCE_HOLD=y
# default:
CONFIG_SOC_GPIO_VALID_GPIO_MASK=0x1FFFFFFFFFFFF
# default:
CONFIG_SOC_GPIO_IN_RANGE_MAX=48
# default:
CONFIG_SOC_GPIO_OUT_RANGE_MAX=48
# default:
CONFIG_SOC_GPIO_VALID_DIGITAL_IO_PAD_MASK=0x0001FFFFFC000000
# default:
CONFIG_SOC_GPIO_CLOCKOUT_BY_IO_MUX=y
# default:
CONFIG_SOC_GPIO_CLOCKOUT_CHANNEL_NUM=3
# default:
CONFIG_SOC_I2C_NUM=2
# default:
CONFIG_SOC_HP_I2C_NUM=2
# default:
CONFIG_SOC_I2C_SUPPORT_XTAL=y
# default:
CONFIG_SOC_I2C_SUPPORT_RTC=y
# default:
CONFIG_SOC_I2C_SUPPORT_10BIT_ADDR=y
# default:
CONFIG_SOC_I2C_SUPPORT_SLAVE=y
# default:
CONFIG_SOC_I2C_SLAVE_SUPPORT_BROADCAST=y
# default:
CONFIG_SOC_I2C_SLAVE_CAN_GET_STRETCH_CAUSE=y
# default:
CONFIG_SOC_I2S_HW_VERSION_2=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_TX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PCM2PDM=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM_RX=y
# default:
CONFIG_SOC_I2S_SUPPORTS_PDM2PCM=y
# default:
CONFIG_SOC_I2S_PDM_MAX_TX_LINES=2
# default:
CONFIG_SOC_I2S_PDM_MAX_RX_LINES=4
# default:
CONFIG_SOC_I2S_SUPPORTS_TDM=y
# default:
CONFIG_SOC_LEDC_SUPPORT_APB_CLOCK=y
# default:
CONFIG_SOC_LEDC_SUPPORT_XTAL_CLOCK=y
# default:
CONFIG_SOC_LEDC_TIMER_NUM=4
# default:
CONFIG_SOC_LEDC_CHANNEL_NUM=8
# default:
CONFIG_SOC_LEDC_TIMER_BIT_WIDTH=14
# default:
CONFIG_SOC_LEDC_SUPPORT_FADE_STOP=y
# default:
CONFIG_SOC_MCPWM_SWSYNC_CAN_PROPAGATE=y
# default:
CONFIG_SOC_MMU_LINEAR_ADDRESS_REGION_NUM=1
# default:
CONFIG_SOC_MMU_PERIPH_NUM=1
# default:
CONFIG_SOC_MPU_MIN_REGION_SIZE=0x20000000
# default:
CONFIG_SOC_MPU_REGIONS_MAX_NUM=8
# default:
CONFIG_SOC_RMT_MEM_WORDS_PER_CHANNEL=48
# default:
CONFIG_SOC_RMT_SUPPORT_RX_PINGPONG=y
# default:
CONFIG_SOC_RMT_SUPPORT_TX_LOOP_COUNT=y
# default:
CONFIG_SOC_RMT_SUPPORT_TX_LOOP_AUTO_STOP=y
# default:
CONFIG_SOC_RMT_SUPPORT_DMA=y
# default:
CONFIG_SOC_RTC_CNTL_CPU_PD_DMA_BUS_WIDTH=128
# default:
CONFIG_SOC_RTC_CNTL_CPU_PD_REG_FILE_NUM=549
# default:
CONFIG_SOC_RTC_CNTL_TAGMEM_PD_DMA_BUS_WIDTH=128
# default:
CONFIG_SOC_RTC_CNTL_NEEDS_ATOMIC_ACCESS=y
# default:
CONFIG_SOC_RTCIO_PIN_COUNT=22
# default:
CONFIG_SOC_RTCIO_INPUT_OUTPUT_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_HOLD_SUPPORTED=y
# default:
CONFIG_SOC_RTCIO_WAKE_SUPPORTED=y
# default:
CONFIG_SOC_LP_IO_CLOCK_IS_INDEPENDENT=y
# default:
CONFIG_SOC_SPI_PERIPH_NUM=3
# default:
CONFIG_SOC_SPI_MAX_CS_NUM=6
# default:
CONFIG_SOC_SPI_MAXIMUM_BUFFER_SIZE=64
# default:
CONFIG_SOC_SPI_SUPPORT_DDRCLK=y
# default:
CONFIG_SOC_SPI_SLAVE_SUPPORT_SEG_TRANS=y
# default:
CONFIG_SOC_SPI_SUPPORT_CD_SIG=y
# default:
CONFIG_SOC_SPI_SUPPORT_CONTINUOUS_TRANS=y
# default:
CONFIG_SOC_SPI_SUPPORT_SLAVE_HD_VER2=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_APB=y
# default:
CONFIG_SOC_SPI_SUPPORT_CLK_XTAL=y
# default:
CONFIG_SOC_SPI_PERIPH_SUPPORT_CONTROL_DUMMY_OUT=y
# default:
CONFIG_SOC_MEMSPI_IS_INDEPENDENT=y
# default:
CONFIG_SOC_SPI_MAX_PRE_DIVIDER=16
# default:
CONFIG_SOC_SPI_SUPPORT_OCT=y
# default:
CONFIG_SOC_SPI_SCT_SUPPORTED=y
# default:
CONFIG_SOC_SPI_SCT_REG_NUM=14
# default:
CONFIG_SOC_SPI_SCT_BUFFER_NUM_MAX=y
# default:
CONFIG_SOC_SPI_SCT_CONF_BITLEN_MAX=0x3FFFA
# default:
CONFIG_SOC_SPIRAM_SUPPORTED=y
# default:
CONFIG_SOC_SPIRAM_XIP_SUPPORTED=y
# default:
CONFIG_SOC_SYSTIMER_COUNTER_NUM=2
# default:
CONFIG_SOC_SYSTIMER_ALARM_NUM=3
# default:
CONFIG_SOC_SYSTIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_SYSTIMER_BIT_WIDTH_HI=20
# default:
CONFIG_SOC_SYSTIMER_FIXED_DIVIDER=y
# default:
CONFIG_SOC_SYSTIMER_INT_LEVEL=y
# default:
CONFIG_SOC_SYSTIMER_ALARM_MISS_COMPENSATE=y
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_LO=32
# default:
CONFIG_SOC_LP_TIMER_BIT_WIDTH_HI=16
# default:
CONFIG_SOC_TOUCH_SENSOR_VERSION=2
# default:
CONFIG_SOC_TOUCH_MIN_CHAN_ID=1
# default:
CONFIG_SOC_TOUCH_MAX_CHAN_ID=14
# default:
CONFIG_SOC_TOUCH_SUPPORT_BENCHMARK=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_SLEEP_WAKEUP=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_WATERPROOF=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_PROX_SENSING=y
# default:
CONFIG_SOC_TOUCH_SUPPORT_DENOISE_CHAN=y
# default:
CONFIG_SOC_TOUCH_PROXIMITY_CHANNEL_NUM=3
# default:
CONFIG_SOC_TOUCH_SAMPLE_CFG_NUM=1
# default:
CONFIG_SOC_TWAI_CONTROLLER_NUM=1
# default:
CONFIG_SOC_TWAI_MASK_FILTER_NUM=1
# default:
CONFIG_SOC_UART_NUM=3
# default:
CONFIG_SOC_UART_HP_NUM=3
# default:
CONFIG_SOC_UART_FIFO_LEN=128
# default:
CONFIG_SOC_UART_BITRATE_MAX=5000000
# default:
CONFIG_SOC_UART_SUPPORT_WAKEUP_INT=y
# default:
CONFIG_SOC_UART_SUPPORT_APB_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_RTC_CLK=y
# default:
CONFIG_SOC_UART_SUPPORT_XTAL_CLK=y
# default:
CONFIG_SOC_UART_WAKEUP_SUPPORT_ACTIVE_THRESH_MODE=y
# default:
CONFIG_SOC_UHCI_NUM=1
# default:
CONFIG_SOC_USB_OTG_PERIPH_NUM=1
# default:
CONFIG_SOC_USB_FSLS_PHY_NUM=1
# default:
CONFIG_SOC_SHA_DMA_MAX_BUFFER_SIZE=3968
# default:
CONFIG_SOC_SHA_SUPPORT_DMA=y
# default:
CONFIG_SOC_SHA_SUPPORT_RESUME=y
# default:
CONFIG_SOC_SHA_GDMA=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA1=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA224=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA256=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA384=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512_224=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512_256=y
# default:
CONFIG_SOC_SHA_SUPPORT_SHA512_T=y
# default:
CONFIG_SOC_MPI_MEM_BLOCKS_NUM=4
# default:
CONFIG_SOC_MPI_OPERATIONS_NUM=3
# default:
CONFIG_SOC_RSA_MAX_BIT_LEN=4096
# default:
CONFIG_SOC_AES_SUPPORT_DMA=y
# default:
CONFIG_SOC_AES_GDMA=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_128=y
# default:
CONFIG_SOC_AES_SUPPORT_AES_256=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT0_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT1_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_EXT_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_WIFI_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_BT_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_TOUCH_SENSOR_WAKEUP=y
# default:
CONFIG_SOC_PM_SUPPORT_CPU_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_TAGMEM_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RTC_PERIPH_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_RC_FAST_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_VDDSDIO_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_MAC_BB_PD=y
# default:
CONFIG_SOC_PM_SUPPORT_MODEM_PD=y
# default:
CONFIG_SOC_CONFIGURABLE_VDDSDIO_SUPPORTED=y
# default:
CONFIG_SOC_PM_SUPPORT_DEEPSLEEP_CHECK_STUB_ONLY=y
# default:
CONFIG_SOC_PM_CPU_RETENTION_BY_RTCCNTL=y
# default:
CONFIG_SOC_PM_MODEM_RETENTION_BY_BACKUPDMA=y
# default:
CONFIG_SOC_PM_MODEM_PD_BY_SW=y
# default:
CONFIG_SOC_CLK_RC_FAST_D256_SUPPORTED=y
# default:
CONFIG_SOC_RTC_SLOW_CLK_SUPPORT_RC_FAST_D256=y
# default:
CONFIG_SOC_CLK_RC_FAST_SUPPORT_CALIBRATION=y
# default:
CONFIG_SOC_CLK_XTAL32K_SUPPORTED=y
# default:
CONFIG_SOC_CLK_LP_FAST_SUPPORT_XTAL_D2=y
# default:
CONFIG_SOC_EFUSE_DIS_DOWNLOAD_ICACHE=y
# default:
CONFIG_SOC_EFUSE_DIS_DOWNLOAD_DCACHE=y
# default:
CONFIG_SOC_EFUSE_HARD_DIS_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_USB_JTAG=y
# default:
CONFIG_SOC_EFUSE_SOFT_DIS_JTAG=y
# default:
CONFIG_SOC_EFUSE_DIS_DIRECT_BOOT=y
# default:
CONFIG_SOC_EFUSE_DIS_ICACHE=y
# default:
CONFIG_SOC_EFUSE_BLOCK9_KEY_PURPOSE_QUIRK=y
# default:
CONFIG_SOC_EFUSE_XTS_AES_KEY_128=y
# default:
CONFIG_SOC_EFUSE_XTS_AES_KEY_256=y
# default:
CONFIG_SOC_SECURE_BOOT_V2_RSA=y
# default:
CONFIG_SOC_EFUSE_SECURE_BOOT_KEY_DIGESTS=3
# default:
CONFIG_SOC_EFUSE_REVOKE_BOOT_KEY_DIGESTS=y
# default:
CONFIG_SOC_SUPPORT_SECURE_BOOT_REVOKE_KEY=y
# default:
CONFIG_SOC_FLASH_ENCRYPTED_XTS_AES_BLOCK_MAX=64
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_OPTIONS=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_128=y
# default:
CONFIG_SOC_FLASH_ENCRYPTION_XTS_AES_256=y
# default:
CONFIG_SOC_MEMPROT_CPU_PREFETCH_PAD_SIZE=16
# default:
CONFIG_SOC_MEMPROT_MEM_ALIGN_SIZE=256
# default:
CONFIG_SOC_PHY_DIG_REGS_MEM_SIZE=21
# default:
CONFIG_SOC_MAC_BB_PD_MEM_SIZE=192
# default:
CONFIG_SOC_WIFI_LIGHT_SLEEP_CLK_WIDTH=12
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_WAIT_IDLE=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_SUSPEND=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_AUTO_RESUME=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_SW_SUSPEND=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_FLASH_OPI_MODE=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_TIMING_TUNING=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_CONFIG_GPIO_BY_EFUSE=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_WRAP=y
# default:
CONFIG_SOC_MEMSPI_TIMING_TUNING_BY_MSPI_DELAY=y
# default:
CONFIG_SOC_MEMSPI_CORE_CLK_SHARED_WITH_PSRAM=y
# default:
CONFIG_SOC_SPI_MEM_SUPPORT_CACHE_32BIT_ADDR_MAP=y
# default:
CONFIG_SOC_SPI_MEM_FLASH_SUPPORT_HPM=y
# default:
CONFIG_SOC_MEMSPI_ENCRYPTION_ALIGNMENT=16
# default:
CONFIG_SOC_COEX_HW_PTI=y
# default:
CONFIG_SOC_EXTERNAL_COEX_LEADER_TX_LINE=y
# default:
CONFIG_SOC_SDMMC_USE_GPIO_MATRIX=y
# default:
CONFIG_SOC_SDMMC_NUM_SLOTS=2
# default:
CONFIG_SOC_SDMMC_DATA_WIDTH_MAX=8
# default:
CONFIG_SOC_SDMMC_DELAY_PHASE_NUM=4
# default:
CONFIG_SOC_TEMPERATURE_SENSOR_SUPPORT_FAST_RC=y
# default:
CONFIG_SOC_WIFI_HW_TSF=y
# default:
CONFIG_SOC_WIFI_FTM_SUPPORT=y
# default:
CONFIG_SOC_WIFI_GCMP_SUPPORT=y
# default:
CONFIG_SOC_WIFI_WAPI_SUPPORT=y
# default:
CONFIG_SOC_WIFI_TXOP_SUPPORT=y
# default:
CONFIG_SOC_WIFI_CSI_SUPPORT=y
# default:
CONFIG_SOC_WIFI_MESH_SUPPORT=y
# default:
CONFIG_SOC_WIFI_SUPPORT_VARIABLE_BEACON_WINDOW=y
# default:
CONFIG_SOC_WIFI_PHY_NEEDS_USB_WORKAROUND=y
# default:
CONFIG_SOC_BLE_SUPPORTED=y
# default:
CONFIG_SOC_BLE_MESH_SUPPORTED=y
# default:
CONFIG_SOC_BLE_50_SUPPORTED=y
# default:
CONFIG_SOC_BLE_DEVICE_PRIVACY_SUPPORTED=y
# default:
CONFIG_SOC_BLUFI_SUPPORTED=y
# default:
CONFIG_SOC_ULP_HAS_ADC=y
# default:
CONFIG_SOC_PHY_COMBO_MODULE=y
# default:
CONFIG_SOC_LCDCAM_CAM_SUPPORT_RGB_YUV_CONV=y
# default:
CONFIG_IDF_CMAKE=y
# default:
CONFIG_IDF_TOOLCHAIN="gcc"
# default:
CONFIG_IDF_TOOLCHAIN_GCC=y
# default:
CONFIG_IDF_TARGET_ARCH_XTENSA=y
# default:
CONFIG_IDF_TARGET_ARCH="xtensa"
# default:
CONFIG_IDF_TARGET="esp32s3"
# default:
CONFIG_IDF_INIT_VERSION="6.0.2"
# default:
CONFIG_IDF_TARGET_ESP32S3=y
# default:
CONFIG_IDF_FIRMWARE_CHIP_ID=0x0009

#
# Build type
#
# default:
CONFIG_APP_BUILD_TYPE_APP_2NDBOOT=y
# default:
# CONFIG_APP_BUILD_TYPE_RAM is not set
# default:
CONFIG_APP_BUILD_GENERATE_BINARIES=y
# default:
CONFIG_APP_BUILD_BOOTLOADER=y
# default:
CONFIG_APP_BUILD_USE_FLASH_SECTIONS=y
# default:
# CONFIG_APP_REPRODUCIBLE_BUILD is not set
# default:
# CONFIG_APP_NO_BLOBS is not set
# end of Build type

#
# App Update config
#
# end of App Update config

#
# Bootloader config
#

#
# Bootloader manager
#
# default:
CONFIG_BOOTLOADER_COMPILE_TIME_DATE=y
# default:
CONFIG_BOOTLOADER_PROJECT_VER=1
# end of Bootloader manager

#
# Application Rollback
#
# default:
# CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE is not set
# end of Application Rollback

#
# Recovery Bootloader and Rollback
#
# end of Recovery Bootloader and Rollback

# default:
CONFIG_BOOTLOADER_OFFSET_IN_FLASH=0x0
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_SIZE is not set
# CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_DEBUG is not set
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y

#
# Log
#
# default:
CONFIG_BOOTLOADER_LOG_VERSION_1=y
# default:
CONFIG_BOOTLOADER_LOG_VERSION=1
CONFIG_BOOTLOADER_LOG_LEVEL_NONE=y
# CONFIG_BOOTLOADER_LOG_LEVEL_ERROR is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_WARN is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_INFO is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_DEBUG is not set
# CONFIG_BOOTLOADER_LOG_LEVEL_VERBOSE is not set
# default:
CONFIG_BOOTLOADER_LOG_LEVEL=0

#
# Format
#
# default:
# CONFIG_BOOTLOADER_LOG_COLORS is not set
# default:
CONFIG_BOOTLOADER_LOG_TIMESTAMP_SOURCE_CPU_TICKS=y
# end of Format

#
# Settings
#
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT_EN=y
# default:
CONFIG_BOOTLOADER_LOG_MODE_TEXT=y
# end of Settings
# end of Log

# default:
CONFIG_BOOTLOADER_CPU_CLK_FREQ_MHZ=80

#
# Serial Flash Configurations
#
# default:
# CONFIG_BOOTLOADER_FLASH_DC_AWARE is not set
# default:
CONFIG_BOOTLOADER_FLASH_XMC_SUPPORT=y
# end of Serial Flash Configurations

# default:
CONFIG_BOOTLOADER_VDDSDIO_BOOST_1_9V=y
# default:
# CONFIG_BOOTLOADER_FACTORY_RESET is not set
# default:
# CONFIG_BOOTLOADER_APP_TEST is not set
# default:
CONFIG_BOOTLOADER_REGION_PROTECTION_ENABLE=y
# default:
CONFIG_BOOTLOADER_WDT_ENABLE=y
# default:
# CONFIG_BOOTLOADER_WDT_DISABLE_IN_USER_CODE is not set
# default:
CONFIG_BOOTLOADER_WDT_TIME_MS=9000
CONFIG_BOOTLOADER_SKIP_VALIDATE_IN_DEEP_SLEEP=y
CONFIG_BOOTLOADER_SKIP_VALIDATE_ON_POWER_ON=y
# default:
# CONFIG_BOOTLOADER_SKIP_VALIDATE_ALWAYS is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_SIZE=0x10
# default:
# CONFIG_BOOTLOADER_CUSTOM_RESERVE_RTC is not set
# default:
CONFIG_BOOTLOADER_RESERVE_RTC_MEM=y
# end of Bootloader config

