DovPearX/vesc_express/sdkconfig.defaults.esp32s3_fh4
#
# Security features
#
# default:
CONFIG_SECURE_BOOT_V2_RSA_SUPPORTED=y
# default:
CONFIG_SECURE_BOOT_V2_PREFERRED=y
# default:
# CONFIG_SECURE_SIGNED_APPS_NO_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_BOOT is not set
# default:
# CONFIG_SECURE_FLASH_ENC_ENABLED is not set
# default:
CONFIG_SECURE_ROM_DL_MODE_ENABLED=y
# end of Security features

#
# Application manager
#
# default:
CONFIG_APP_COMPILE_TIME_DATE=y
# default:
# CONFIG_APP_EXCLUDE_PROJECT_VER_VAR is not set
# default:
# CONFIG_APP_EXCLUDE_PROJECT_NAME_VAR is not set
# default:
# CONFIG_APP_PROJECT_VER_FROM_CONFIG is not set
CONFIG_APP_RETRIEVE_LEN_ELF_SHA=16
# end of Application manager

# default:
CONFIG_ESP_ROM_HAS_CRC_LE=y
# default:
CONFIG_ESP_ROM_HAS_CRC_BE=y
# default:
CONFIG_ESP_ROM_HAS_MZ_CRC32=y
# default:
CONFIG_ESP_ROM_HAS_JPEG_DECODE=y
# default:
CONFIG_ESP_ROM_UART_CLK_IS_XTAL=y
# default:
CONFIG_ESP_ROM_HAS_RETARGETABLE_LOCKING=y
# default:
CONFIG_ESP_ROM_USB_OTG_NUM=3
# default:
CONFIG_ESP_ROM_USB_SERIAL_DEVICE_NUM=4
# default:
CONFIG_ESP_ROM_HAS_ERASE_0_REGION_BUG=y
# default:
CONFIG_ESP_ROM_HAS_ENCRYPTED_WRITES_USING_LEGACY_DRV=y
# default:
CONFIG_ESP_ROM_GET_CLK_FREQ=y
# default:
CONFIG_ESP_ROM_HAS_HAL_WDT=y
# default:
CONFIG_ESP_ROM_NEEDS_SWSETUP_WORKAROUND=y
# default:
CONFIG_ESP_ROM_HAS_LAYOUT_TABLE=y
# default:
CONFIG_ESP_ROM_HAS_SPI_FLASH=y
# default:
CONFIG_ESP_ROM_HAS_SPI_FLASH_MMAP=y
# default:
CONFIG_ESP_ROM_HAS_ETS_PRINTF_BUG=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_NANO_FORMAT=y
# default:
CONFIG_ESP_ROM_HAS_NEWLIB_32BIT_TIME=y
# default:
CONFIG_ESP_ROM_NEEDS_SET_CACHE_MMU_SIZE=y
# default:
CONFIG_ESP_ROM_RAM_APP_NEEDS_MMU_INIT=y
# default:
CONFIG_ESP_ROM_HAS_FLASH_COUNT_PAGES_BUG=y
# default:
CONFIG_ESP_ROM_HAS_CACHE_SUSPEND_WAITI_BUG=y
# default:
CONFIG_ESP_ROM_HAS_CACHE_WRITEBACK_BUG=y
# default:
CONFIG_ESP_ROM_HAS_SW_FLOAT=y
# default:
CONFIG_ESP_ROM_HAS_VERSION=y
# default:
CONFIG_ESP_ROM_SUPPORT_DEEP_SLEEP_WAKEUP_STUB=y
# default:
CONFIG_ESP_ROM_HAS_OUTPUT_PUTC_FUNC=y
# default:
CONFIG_ESP_ROM_CONSOLE_OUTPUT_SECONDARY=y

#
# Boot ROM Behavior
#
# CONFIG_BOOT_ROM_LOG_ALWAYS_ON is not set
CONFIG_BOOT_ROM_LOG_ALWAYS_OFF=y
# CONFIG_BOOT_ROM_LOG_ON_GPIO_HIGH is not set
# CONFIG_BOOT_ROM_LOG_ON_GPIO_LOW is not set
# end of Boot ROM Behavior

#
# Serial flasher config
#
# default:
# CONFIG_ESPTOOLPY_NO_STUB is not set
# default:
# CONFIG_ESPTOOLPY_OCT_FLASH is not set
# default:
CONFIG_ESPTOOLPY_FLASH_MODE_AUTO_DETECT=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
# CONFIG_ESPTOOLPY_FLASHMODE_QOUT is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DIO is not set
# CONFIG_ESPTOOLPY_FLASHMODE_DOUT is not set
# default:
CONFIG_ESPTOOLPY_FLASH_SAMPLE_MODE_STR=y
# default:
CONFIG_ESPTOOLPY_FLASHMODE="dio"
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_120M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_40M is not set
# default:
# CONFIG_ESPTOOLPY_FLASHFREQ_20M is not set
# default:
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
# CONFIG_ESPTOOLPY_FLASHSIZE_1MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_2MB is not set
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# CONFIG_ESPTOOLPY_FLASHSIZE_8MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_16MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_32MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_64MB is not set
# CONFIG_ESPTOOLPY_FLASHSIZE_128MB is not set
# default:
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
# default:
# CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE is not set
# default:
CONFIG_ESPTOOLPY_BEFORE_RESET=y
# default:
# CONFIG_ESPTOOLPY_BEFORE_NORESET is not set
# default:
CONFIG_ESPTOOLPY_BEFORE="default-reset"
# default:
CONFIG_ESPTOOLPY_AFTER_RESET=y
# default:
# CONFIG_ESPTOOLPY_AFTER_NORESET is not set
# default:
CONFIG_ESPTOOLPY_AFTER="hard-reset"
# default:
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200
# end of Serial flasher config

#
# Partition Table
#
# CONFIG_PARTITION_TABLE_SINGLE_APP is not set
# CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE is not set
# CONFIG_PARTITION_TABLE_TWO_OTA is not set
# CONFIG_PARTITION_TABLE_TWO_OTA_LARGE is not set
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partition_ota_4mb.csv"
# default:
CONFIG_PARTITION_TABLE_FILENAME="partition_ota_4mb.csv"
# default:
CONFIG_PARTITION_TABLE_OFFSET=0x8000
# default:
CONFIG_PARTITION_TABLE_MD5=y
# end of Partition Table

#
# XPT2046
#
# default:
CONFIG_XPT2046_Z_THRESHOLD=400
# default:
# CONFIG_XPT2046_INTERRUPT_MODE is not set
# default:
# CONFIG_XPT2046_VREF_ON_MODE is not set
# default:
CONFIG_XPT2046_CONVERT_ADC_TO_COORDS=y
# default:
# CONFIG_XPT2046_ENABLE_LOCKING is not set
# end of XPT2046

#
# Compiler options
#
# CONFIG_COMPILER_OPTIMIZATION_DEBUG is not set
# CONFIG_COMPILER_OPTIMIZATION_SIZE is not set
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# CONFIG_COMPILER_OPTIMIZATION_NONE is not set
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE is not set
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y
# CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE is not set
CONFIG_COMPILER_ASSERT_NDEBUG_EVALUATE=y
# default:
CONFIG_COMPILER_FLOAT_LIB_FROM_GCCLIB=y
# default:
CONFIG_COMPILER_OPTIMIZATION_ASSERTION_LEVEL=1
# default:
# CONFIG_COMPILER_OPTIMIZATION_CHECKS_SILENT is not set
# CONFIG_COMPILER_HIDE_PATHS_MACROS is not set
# default:
# CONFIG_COMPILER_CXX_EXCEPTIONS is not set
# default:
# CONFIG_COMPILER_CXX_RTTI is not set
# default:
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_NORM is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_STRONG is not set
# default:
# CONFIG_COMPILER_STACK_CHECK_MODE_ALL is not set
# default:
# CONFIG_COMPILER_NO_MERGE_CONSTANTS is not set
# default:
# CONFIG_COMPILER_WARN_WRITE_STRINGS is not set
CONFIG_COMPILER_DISABLE_DEFAULT_ERRORS=y
# default:
# CONFIG_COMPILER_DISABLE_GCC12_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC13_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC14_WARNINGS is not set
# default:
# CONFIG_COMPILER_DISABLE_GCC15_WARNINGS is not set
# default:
# CONFIG_COMPILER_DUMP_RTL_FILES is not set
# default:
CONFIG_COMPILER_RT_LIB_GCCLIB=y
# default:
CONFIG_COMPILER_RT_LIB_NAME="gcc"
# CONFIG_COMPILER_ORPHAN_SECTIONS_ERROR is not set
CONFIG_COMPILER_ORPHAN_SECTIONS_WARNING=y
# CONFIG_COMPILER_ORPHAN_SECTIONS_PLACE is not set
# default:
# CONFIG_COMPILER_STATIC_ANALYZER is not set
# default:
CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_NO_CHANGE=y
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD_CONSTEXPR is not set
# default:
# CONFIG_COMPILER_CXX_GLIBCXX_CONSTEXPR_COLD is not set
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
# default:
CONFIG_BT_BLUEDROID_ENABLED=y
# default:
# CONFIG_BT_NIMBLE_ENABLED is not set
# default:
# CONFIG_BT_CONTROLLER_ONLY is not set
# default:
CONFIG_BT_CONTROLLER_ENABLED=y
# default:
# CONFIG_BT_CONTROLLER_DISABLED is not set

#
# Common Options
#
# default:
CONFIG_BT_ALARM_MAX_NUM=50
# default:
CONFIG_BT_SMP_CRYPTO_STACK_TINYCRYPT=y
# default:
# CONFIG_BT_SMP_CRYPTO_STACK_MBEDTLS is not set

#
# BT Logs
#

#
# Log Sources
#
# end of Log Sources

# default:
# CONFIG_BLE_LOG_ENABLED is not set

#
# Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
#
# default:
# CONFIG_BT_BLE_LOG_SPI_OUT_ENABLED is not set
# end of Legacy SPI Log Output (Deprecated - use BT Log Async Output instead)
# end of BT Logs

# default:
# CONFIG_BT_LE_USED_MEM_STATISTICS_ENABLED is not set
# end of Common Options

#
# Bluedroid Options
#
# default:
CONFIG_BT_BTC_TASK_STACK_SIZE=3072
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE_0=y
# default:
# CONFIG_BT_BLUEDROID_PINNED_TO_CORE_1 is not set
# default:
CONFIG_BT_BLUEDROID_PINNED_TO_CORE=0
CONFIG_BT_BTU_TASK_STACK_SIZE=4096
# default:
CONFIG_BT_BLUEDROID_ESP_COEX_VSC=y
# default:
CONFIG_BT_BLE_ENABLED=y
# default:
CONFIG_BT_GATTS_ENABLE=y
# default:
# CONFIG_BT_GATTS_PPCP_CHAR_GAP is not set
# default:
# CONFIG_BT_BLE_BLUFI_ENABLE is not set
CONFIG_BT_GATT_MAX_SR_PROFILES=4
CONFIG_BT_GATT_MAX_SR_ATTRIBUTES=20
# default:
# CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MANUAL is not set
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_AUTO=y
# default:
CONFIG_BT_GATTS_SEND_SERVICE_CHANGE_MODE=0
# default:
# CONFIG_BT_GATTS_ROBUST_CACHING_ENABLED is not set
# default:
# CONFIG_BT_GATTS_DEVICE_NAME_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_APPEARANCE_WRITABLE is not set
# default:
# CONFIG_BT_GATTS_SECURITY_LEVELS_CHAR is not set
# default:
# CONFIG_BT_GATTS_KEY_MATERIAL_CHAR is not set
# CONFIG_BT_GATTC_ENABLE is not set
# default:
CONFIG_BT_BLE_SMP_ENABLE=y
# default:
# CONFIG_BT_SMP_SLAVE_CON_PARAMS_UPD_ENABLE is not set
# default:
# CONFIG_BT_BLE_SMP_ID_RESET_ENABLE is not set
# default:
CONFIG_BT_BLE_SMP_BOND_NVS_FLASH=y

#
# Bluedroid debug option
#
# default:
# CONFIG_BT_BLUEDROID_MEM_DEBUG is not set
# default:
# CONFIG_BT_BLUEDROID_MEM_STATS is not set
# default:
# CONFIG_BT_BLUEDROID_THREAD_DEBUG is not set
# end of Bluedroid debug option

CONFIG_BT_STACK_NO_LOG=y
CONFIG_BT_ACL_CONNECTIONS=3
# CONFIG_BT_MULTI_CONNECTION_ENBALE is not set
# default:
# CONFIG_BT_ALLOCATION_FROM_SPIRAM_FIRST is not set
CONFIG_BT_BLE_DYNAMIC_ENV_MEMORY=y
# default:
CONFIG_BT_SMP_ENABLE=y
# default:
CONFIG_BT_SMP_MAX_BONDS=15
# default:
# CONFIG_BT_BLE_ACT_SCAN_REP_ADV_SCAN is not set
# default:
CONFIG_BT_MAX_DEVICE_NAME_LEN=32
# default:
CONFIG_BT_BLE_RPA_TIMEOUT=900
# default:
CONFIG_BT_BLE_HOST_ALLOW_SUB_SPEC_MIN_CONN_INT=y
# default:
CONFIG_BT_BLE_50_FEATURES_SUPPORTED=y
# default:
CONFIG_BT_BLE_50_EXTEND_ADV_EN=y
# default:
CONFIG_BT_BLE_50_PERIODIC_ADV_EN=y
# default:
CONFIG_BT_BLE_50_EXTEND_SCAN_EN=y
# default:
CONFIG_BT_BLE_50_EXTEND_SYNC_EN=y
# default:
CONFIG_BT_BLE_50_DTM_TEST_EN=y
# default:
CONFIG_BT_BLE_FEAT_CREATE_SYNC_RETRY_MAX=3
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# default:
CONFIG_BT_BLE_42_DTM_TEST_EN=y
# default:
CONFIG_BT_BLE_42_ADV_EN=y
# default:
CONFIG_BT_BLE_42_SCAN_EN=y
# default:
CONFIG_BT_BLE_VENDOR_HCI_EN=y
# default:
# CONFIG_BT_BLE_HIGH_DUTY_ADV_INTERVAL is not set
# default:
# CONFIG_BT_ABORT_WHEN_ALLOCATION_FAILS is not set
# end of Bluedroid Options

#
# Controller Options
#
# default:
CONFIG_BT_CTRL_MODE_EFF=1
CONFIG_BT_CTRL_BLE_MAX_ACT=2
# default:
CONFIG_BT_CTRL_BLE_MAX_ACT_EFF=2
# default:
CONFIG_BT_CTRL_BLE_STATIC_ACL_TX_BUF_NB=0
# default:
CONFIG_BT_CTRL_PINNED_TO_CORE_0=y
# default:
# CONFIG_BT_CTRL_PINNED_TO_CORE_1 is not set
# default:
CONFIG_BT_CTRL_PINNED_TO_CORE=0
# default:
CONFIG_BT_CTRL_HCI_MODE_VHCI=y
# default:
# CONFIG_BT_CTRL_HCI_MODE_UART_H4 is not set
# default:
CONFIG_BT_CTRL_HCI_TL=1
# default:
CONFIG_BT_CTRL_ADV_DUP_FILT_MAX=30
# default:
CONFIG_BT_BLE_CCA_MODE_NONE=y
# default:
# CONFIG_BT_BLE_CCA_MODE_HW is not set
# default:
# CONFIG_BT_BLE_CCA_MODE_SW is not set
# default:
CONFIG_BT_BLE_CCA_MODE=0
CONFIG_BT_CTRL_HW_CCA_VAL=20
# default:
CONFIG_BT_CTRL_HW_CCA_EFF=0
# default:
CONFIG_BT_CTRL_CE_LENGTH_TYPE_ORIG=y
# default:
# CONFIG_BT_CTRL_CE_LENGTH_TYPE_CE is not set
# default:
# CONFIG_BT_CTRL_CE_LENGTH_TYPE_SD is not set
# default:
CONFIG_BT_CTRL_CE_LENGTH_TYPE_EFF=0
# default:
CONFIG_BT_CTRL_TX_ANTENNA_INDEX_0=y
# default:
# CONFIG_BT_CTRL_TX_ANTENNA_INDEX_1 is not set
# default:
CONFIG_BT_CTRL_TX_ANTENNA_INDEX_EFF=0
# default:
CONFIG_BT_CTRL_RX_ANTENNA_INDEX_0=y
# default:
# CONFIG_BT_CTRL_RX_ANTENNA_INDEX_1 is not set
# default:
CONFIG_BT_CTRL_RX_ANTENNA_INDEX_EFF=0
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N24 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N21 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N18 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N15 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N12 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N9 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N6 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N3 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_N0 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P3 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P6 is not set
# default:
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P9=y
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P12 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P15 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P18 is not set
# default:
# CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P20 is not set
# default:
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_EFF=11
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_SUPP=y
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_FLOW_CTRL_NUM=100
# default:
CONFIG_BT_CTRL_BLE_ADV_REPORT_DISCARD_THRSHOLD=20
# CONFIG_BT_CTRL_BLE_SCAN_DUPL is not set
# default:
# CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_EN is not set
# default:
CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_DIS=y
# default:
CONFIG_BT_CTRL_COEX_PHY_CODED_TX_RX_TLIM_EFF=0

#
# MODEM SLEEP Options
#
# default:
# CONFIG_BT_CTRL_MODEM_SLEEP is not set
# end of MODEM SLEEP Options

# default:
CONFIG_BT_CTRL_SLEEP_MODE_EFF=0
# default:
CONFIG_BT_CTRL_SLEEP_CLOCK_EFF=0
# default:
CONFIG_BT_CTRL_HCI_TL_EFF=1
# default:
# CONFIG_BT_CTRL_AGC_RECORRECT_EN is not set
# default:
# CONFIG_BT_CTRL_SCAN_BACKOFF_UPPERLIMITMAX is not set
# default:
# CONFIG_BT_BLE_ADV_DATA_LENGTH_ZERO_AUX is not set
# default:
CONFIG_BT_CTRL_CHAN_ASS_EN=y
# default:
CONFIG_BT_CTRL_LE_PING_EN=y

#
# BLE disconnects when Instant Passed (0x28) occurs
#
# default:
# CONFIG_BT_CTRL_BLE_LLCP_CONN_UPDATE is not set
# default:
# CONFIG_BT_CTRL_BLE_LLCP_CHAN_MAP_UPDATE is not set
# default:
# CONFIG_BT_CTRL_BLE_LLCP_PHY_UPDATE is not set
# end of BLE disconnects when Instant Passed (0x28) occurs

# default:
# CONFIG_BT_CTRL_RUN_IN_FLASH_ONLY is not set
# default:
CONFIG_BT_CTRL_DTM_ENABLE=y
# default:
CONFIG_BT_CTRL_BLE_MASTER=y
# default:
# CONFIG_BT_CTRL_BLE_TEST is not set
# default:
CONFIG_BT_CTRL_BLE_SCAN=y
# default:
CONFIG_BT_CTRL_BLE_SECURITY_ENABLE=y
# default:
CONFIG_BT_CTRL_BLE_ADV=y
# default:
# CONFIG_BT_CTRL_CHECK_CONNECT_IND_ACCESS_ADDRESS is not set
# default:
CONFIG_BT_CTRL_BLE_MIN_CONN_INTERVAL_ENABLE=y

#
# Controller debug log Options (Experimental)
#
# default:
# CONFIG_BT_CTRL_LE_LOG_EN is not set
# end of Controller debug log Options (Experimental)
# end of Controller Options

# default:
# CONFIG_BT_HCI_LOG_DEBUG_EN is not set
# end of Bluetooth

# default:
# CONFIG_BLE_MESH is not set

#
# Console Library
#
# default:
# CONFIG_CONSOLE_SORTED_HELP is not set
# end of Console Library

#
# Legacy Driver Configurations
#

#
# Legacy TWAI Driver Configurations
#
# default:
# CONFIG_TWAI_ISR_IN_IRAM_LEGACY is not set
# default:
# CONFIG_TWAI_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_TWAI_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy TWAI Driver Configurations

#
# Legacy I2C Driver Configurations
#
# default:
# CONFIG_I2C_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_I2C_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy I2C Driver Configurations

#
# Legacy Touch Sensor Driver Configurations
#
# default:
# CONFIG_TOUCH_SUPPRESS_DEPRECATE_WARN is not set
# default:
# CONFIG_TOUCH_SKIP_LEGACY_CONFLICT_CHECK is not set
# end of Legacy Touch Sensor Driver Configurations
# end of Legacy Driver Configurations

#
# eFuse Bit Manager
#
# default:
# CONFIG_EFUSE_CUSTOM_TABLE is not set
# default:
# CONFIG_EFUSE_VIRTUAL is not set
# default:
CONFIG_EFUSE_MAX_BLK_LEN=256
# end of eFuse Bit Manager

#
# ESP-TLS
#
# default:
CONFIG_ESP_TLS_USING_MBEDTLS=y
# default:
# CONFIG_ESP_TLS_CUSTOM_STACK is not set
# default:
# CONFIG_ESP_TLS_USE_SECURE_ELEMENT is not set
# default:
CONFIG_ESP_TLS_USE_DS_PERIPHERAL=y
# default:
# CONFIG_ESP_TLS_CLIENT_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_SESSION_TICKETS is not set
# default:
# CONFIG_ESP_TLS_SERVER_CERT_SELECT_HOOK is not set
# default:
# CONFIG_ESP_TLS_SERVER_MIN_AUTH_MODE_OPTIONAL is not set
# default:
# CONFIG_ESP_TLS_PSK_VERIFICATION is not set
# default:
# CONFIG_ESP_TLS_INSECURE is not set
# default:
CONFIG_ESP_TLS_DYN_BUF_STRATEGY_SUPPORTED=y
# end of ESP-TLS

#
# ADC and ADC Calibration
#
# default:
# CONFIG_ADC_ONESHOT_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_ADC_CONTINUOUS_ISR_IRAM_SAFE is not set
# default:
# CONFIG_ADC_CONTINUOUS_FORCE_USE_ADC2_ON_C3_S3 is not set
# default:
# CONFIG_ADC_ENABLE_DEBUG_LOG is not set
# end of ADC and ADC Calibration

#
# Wireless Coexistence
#
# default:
CONFIG_ESP_COEX_ENABLED=y
# default:
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y
# default:
# CONFIG_ESP_COEX_POWER_MANAGEMENT is not set
# default:
# CONFIG_ESP_COEX_GPIO_DEBUG is not set
# end of Wireless Coexistence

#
# Common ESP-related
#
# default:
CONFIG_ESP_ERR_TO_NAME_LOOKUP=y
# end of Common ESP-related

#
# ESP-Driver:Camera Controller Configurations
#
# default:
# CONFIG_CAM_CTLR_DVP_CAM_ISR_CACHE_SAFE is not set
# end of ESP-Driver:Camera Controller Configurations

#
# GDMA Configurations
#
# default:
# CONFIG_GDMA_CTRL_FUNC_IN_IRAM is not set
# default:
CONFIG_GDMA_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_GDMA_OBJ_DRAM_SAFE=y
# default:
# CONFIG_GDMA_ENABLE_DEBUG_LOG is not set
# end of GDMA Configurations

#
# ESP-Driver:GPIO Configurations
#
# default:
# CONFIG_GPIO_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:GPIO Configurations

#
# ESP-Driver:GPTimer Configurations
#
# CONFIG_GPTIMER_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_GPTIMER_ISR_CACHE_SAFE is not set
# default:
# CONFIG_GPTIMER_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:GPTimer Configurations

#
# ESP-Driver:I2C Configurations
#
# default:
# CONFIG_I2C_ISR_IRAM_SAFE is not set
# default:
# CONFIG_I2C_ENABLE_DEBUG_LOG is not set
# default:
CONFIG_I2C_MASTER_ISR_HANDLER_IN_IRAM=y
# end of ESP-Driver:I2C Configurations

