DovPearX/vesc_express/sdkconfig.defaults.esp32s3_fh4
#
# ESP-Driver:I2S Configurations
#
# default:
# CONFIG_I2S_ISR_IRAM_SAFE is not set
# default:
# CONFIG_I2S_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_I2S_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:I2S Configurations

#
# ESP-Driver:I3C Master Configurations
#
# default:
# CONFIG_I3C_MASTER_ISR_CACHE_SAFE is not set
# default:
# CONFIG_I3C_MASTER_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_I3C_MASTER_ISR_HANDLER_IN_IRAM is not set
# end of ESP-Driver:I3C Master Configurations

#
# ESP-Driver:LEDC Configurations
#
# default:
# CONFIG_LEDC_CTRL_FUNC_IN_IRAM is not set
# end of ESP-Driver:LEDC Configurations

#
# ESP-Driver:MCPWM Configurations
#
# default:
CONFIG_MCPWM_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_MCPWM_ISR_CACHE_SAFE is not set
# default:
# CONFIG_MCPWM_CTRL_FUNC_IN_IRAM is not set
# default:
CONFIG_MCPWM_OBJ_CACHE_SAFE=y
# default:
# CONFIG_MCPWM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:MCPWM Configurations

#
# ESP-Driver:PCNT Configurations
#
# default:
# CONFIG_PCNT_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_PCNT_ISR_IRAM_SAFE is not set
# default:
# CONFIG_PCNT_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:PCNT Configurations

#
# ESP-Driver:RMT Configurations
#
# default:
CONFIG_RMT_ENCODER_FUNC_IN_IRAM=y
# default:
CONFIG_RMT_TX_ISR_HANDLER_IN_IRAM=y
# default:
CONFIG_RMT_RX_ISR_HANDLER_IN_IRAM=y
# default:
# CONFIG_RMT_RECV_FUNC_IN_IRAM is not set
# default:
# CONFIG_RMT_TX_ISR_CACHE_SAFE is not set
# default:
# CONFIG_RMT_RX_ISR_CACHE_SAFE is not set
# default:
CONFIG_RMT_OBJ_CACHE_SAFE=y
# default:
# CONFIG_RMT_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_RMT_ISR_IRAM_SAFE is not set
# end of ESP-Driver:RMT Configurations

#
# ESP-Driver:Sigma Delta Modulator Configurations
#
# default:
# CONFIG_SDM_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_SDM_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Sigma Delta Modulator Configurations

#
# ESP-Driver:SD Host SDMMC Controller Configurations
#
# default:
# CONFIG_SD_HOST_SDMMC_ISR_CACHE_SAFE is not set
# end of ESP-Driver:SD Host SDMMC Controller Configurations

#
# ESP-Driver:SPI Configurations
#
# CONFIG_SPI_MASTER_ISR_IN_IRAM is not set
# default:
# CONFIG_SPI_SLAVE_IN_IRAM is not set
# CONFIG_SPI_SLAVE_ISR_IN_IRAM is not set
# end of ESP-Driver:SPI Configurations

#
# ESP-Driver:Touch Sensor Configurations
#
# default:
# CONFIG_TOUCH_CTRL_FUNC_IN_IRAM is not set
# default:
# CONFIG_TOUCH_ISR_IRAM_SAFE is not set
# default:
# CONFIG_TOUCH_ENABLE_DEBUG_LOG is not set
# default:
# CONFIG_TOUCH_SKIP_FSM_CHECK is not set
# end of ESP-Driver:Touch Sensor Configurations

#
# ESP-Driver:Temperature Sensor Configurations
#
# default:
# CONFIG_TEMP_SENSOR_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:Temperature Sensor Configurations

#
# ESP-Driver:TWAI Configurations
#
CONFIG_TWAI_ISR_IN_IRAM=y
# default:
# CONFIG_TWAI_IO_FUNC_IN_IRAM is not set
# default:
# CONFIG_TWAI_ISR_CACHE_SAFE is not set
# default:
CONFIG_TWAI_OBJ_CACHE_SAFE=y
# default:
# CONFIG_TWAI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:TWAI Configurations

#
# ESP-Driver:UART Configurations
#
# end of ESP-Driver:UART Configurations

#
# ESP-Driver:UHCI Configurations
#
# default:
# CONFIG_UHCI_ISR_HANDLER_IN_IRAM is not set
# default:
# CONFIG_UHCI_ISR_CACHE_SAFE is not set
# default:
# CONFIG_UHCI_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:UHCI Configurations

#
# ESP-Driver:USB Serial/JTAG Configuration
#
# default:
CONFIG_USJ_ENABLE_USB_SERIAL_JTAG=y
# end of ESP-Driver:USB Serial/JTAG Configuration

#
# Ethernet
#
# CONFIG_ETH_USE_SPI_ETHERNET is not set
# default:
# CONFIG_ETH_USE_OPENETH is not set
# end of Ethernet

#
# Event Loop Library
#
# default:
# CONFIG_ESP_EVENT_LOOP_PROFILING is not set
# default:
CONFIG_ESP_EVENT_POST_FROM_ISR=y
# default:
CONFIG_ESP_EVENT_POST_FROM_IRAM_ISR=y
# end of Event Loop Library

#
# GDB Stub
#
# default:
CONFIG_ESP_GDBSTUB_ENABLED=y
# default:
# CONFIG_ESP_SYSTEM_GDBSTUB_RUNTIME is not set
# default:
CONFIG_ESP_GDBSTUB_SUPPORT_TASKS=y
# default:
CONFIG_ESP_GDBSTUB_MAX_TASKS=32
# end of GDB Stub

#
# ESP HID
#
# default:
CONFIG_ESPHID_TASK_SIZE_BT=2048
# default:
CONFIG_ESPHID_TASK_SIZE_BLE=4096
# end of ESP HID

#
# ESP HTTP client
#
# CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_BASIC_AUTH is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_DIGEST_AUTH is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_CUSTOM_TRANSPORT is not set
# default:
# CONFIG_ESP_HTTP_CLIENT_ENABLE_GET_CONTENT_RANGE is not set
# default:
CONFIG_ESP_HTTP_CLIENT_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTP_CLIENT_SAVE_RESPONSE_HEADERS is not set
# end of ESP HTTP client

#
# HTTP Server
#
# default:
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
# default:
CONFIG_HTTPD_MAX_URI_LEN=512
# default:
CONFIG_HTTPD_ERR_RESP_NO_DELAY=y
# default:
CONFIG_HTTPD_PURGE_BUF_LEN=32
# default:
# CONFIG_HTTPD_LOG_PURGE_DATA is not set
# default:
# CONFIG_HTTPD_WS_SUPPORT is not set
# default:
# CONFIG_HTTPD_QUEUE_WORK_BLOCKING is not set
# default:
CONFIG_HTTPD_SERVER_EVENT_POST_TIMEOUT=2000
# end of HTTP Server

#
# ESP HTTPS OTA
#
# default:
# CONFIG_ESP_HTTPS_OTA_DECRYPT_CB is not set
# default:
# CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP is not set
# default:
CONFIG_ESP_HTTPS_OTA_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_OTA_ENABLE_PARTIAL_DOWNLOAD is not set
# end of ESP HTTPS OTA

#
# ESP HTTPS server
#
# default:
# CONFIG_ESP_HTTPS_SERVER_ENABLE is not set
# default:
CONFIG_ESP_HTTPS_SERVER_EVENT_POST_TIMEOUT=2000
# default:
# CONFIG_ESP_HTTPS_SERVER_CERT_SELECT_HOOK is not set
# end of ESP HTTPS server

#
# Hardware Settings
#
# default:
CONFIG_ESP_HW_SUPPORT_FUNC_IN_IRAM=y

#
# Chip revision
#
# default:
CONFIG_ESP32S3_REV_MIN_0=y
# default:
# CONFIG_ESP32S3_REV_MIN_1 is not set
# default:
# CONFIG_ESP32S3_REV_MIN_2 is not set
# default:
CONFIG_ESP32S3_REV_MIN_FULL=0
# default:
CONFIG_ESP_REV_MIN_FULL=0

#
# Maximum Supported ESP32-S3 Revision (Rev v0.99)
#
# default:
CONFIG_ESP32S3_REV_MAX_FULL=99
# default:
CONFIG_ESP_REV_MAX_FULL=99
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MIN_FULL=0
# default:
CONFIG_ESP_EFUSE_BLOCK_REV_MAX_FULL=199

#
# Maximum Supported ESP32-S3 eFuse Block Revision (eFuse Block Rev v1.99)
#
# end of Chip revision

#
# MAC Config
#
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_STA=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_WIFI_AP=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_BT=y
# default:
CONFIG_ESP_MAC_ADDR_UNIVERSE_ETH=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES_FOUR=y
# default:
CONFIG_ESP_MAC_UNIVERSAL_MAC_ADDRESSES=4
# default:
# CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES_TWO is not set
# default:
CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES_FOUR=y
# default:
CONFIG_ESP32S3_UNIVERSAL_MAC_ADDRESSES=4
# default:
# CONFIG_ESP_MAC_USE_CUSTOM_MAC_AS_BASE_MAC is not set
# end of MAC Config

#
# Sleep Config
#
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
# default:
CONFIG_ESP_SLEEP_FLASH_LEAKAGE_WORKAROUND=y
# default:
CONFIG_ESP_SLEEP_MSPI_NEED_ALL_IO_PU=y
# default:
CONFIG_ESP_SLEEP_RTC_BUS_ISO_WORKAROUND=y
# default:
CONFIG_ESP_SLEEP_GPIO_RESET_WORKAROUND=y
# default:
CONFIG_ESP_SLEEP_WAIT_FLASH_READY_EXTRA_DELAY=2000
# default:
# CONFIG_ESP_SLEEP_CACHE_SAFE_ASSERTION is not set
# default:
# CONFIG_ESP_SLEEP_DEBUG is not set
# CONFIG_ESP_SLEEP_GPIO_ENABLE_INTERNAL_RESISTORS is not set
# end of Sleep Config

#
# RTC Clock Config
#
# default:
CONFIG_RTC_CLK_SRC_INT_RC=y
# default:
# CONFIG_RTC_CLK_SRC_EXT_CRYS is not set
# default:
# CONFIG_RTC_CLK_SRC_EXT_OSC is not set
# default:
# CONFIG_RTC_CLK_SRC_INT_8MD256 is not set
# default:
CONFIG_RTC_CLK_CAL_CYCLES=1024
# default:
CONFIG_RTC_CLK_FUNC_IN_IRAM=y
# default:
CONFIG_RTC_TIME_FUNC_IN_IRAM=y
# end of RTC Clock Config

#
# Peripheral Control
#
# default:
CONFIG_ESP_PERIPH_CTRL_FUNC_IN_IRAM=y
# default:
CONFIG_ESP_REGI2C_CTRL_FUNC_IN_IRAM=y
# end of Peripheral Control

#
# Main XTAL Config
#
# default:
CONFIG_XTAL_FREQ_40=y
# default:
CONFIG_XTAL_FREQ=40
# end of Main XTAL Config

#
# Power Supplier
#

#
# Brownout Detector
#
# default:
CONFIG_ESP_BROWNOUT_DET=y
# default:
CONFIG_ESP_BROWNOUT_DET_LVL_SEL_7=y
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_6 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_5 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_4 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_3 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_2 is not set
# default:
# CONFIG_ESP_BROWNOUT_DET_LVL_SEL_1 is not set
# default:
CONFIG_ESP_BROWNOUT_DET_LVL=7
# default:
CONFIG_ESP_BROWNOUT_USE_INTR=y
# end of Brownout Detector
# end of Power Supplier

# default:
CONFIG_ESP_INTR_IN_IRAM=y
# end of Hardware Settings

#
# ESP-Driver:LCD Controller Configurations
#
# default:
# CONFIG_LCD_RGB_ISR_IRAM_SAFE is not set
# default:
# CONFIG_LCD_RGB_RESTART_IN_VSYNC is not set
# default:
# CONFIG_LCD_ENABLE_DEBUG_LOG is not set
# end of ESP-Driver:LCD Controller Configurations

#
# LibC
#
# CONFIG_LIBC_NEWLIB is not set
CONFIG_LIBC_PICOLIBC=y
# default:
CONFIG_LIBC_PICOLIBC_NEWLIB_COMPATIBILITY=y
# default:
CONFIG_LIBC_MISC_IN_IRAM=y
# default:
CONFIG_LIBC_LOCKS_PLACE_IN_IRAM=y
# default:
CONFIG_LIBC_STDOUT_LINE_ENDING_CRLF=y
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_LF is not set
# default:
# CONFIG_LIBC_STDOUT_LINE_ENDING_CR is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_CRLF is not set
# default:
# CONFIG_LIBC_STDIN_LINE_ENDING_LF is not set
# default:
CONFIG_LIBC_STDIN_LINE_ENDING_CR=y
# default:
CONFIG_LIBC_TIME_SYSCALL_USE_RTC_HRT=y
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_RTC is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_HRT is not set
# default:
# CONFIG_LIBC_TIME_SYSCALL_USE_NONE is not set
# default:
CONFIG_LIBC_ASSERT_BUFFER_SIZE=200
# end of LibC

#
# ESP-MM: Memory Management Configurations
#
# default:
# CONFIG_ESP_MM_CACHE_MSYNC_C2M_CHUNKED_OPS is not set
# end of ESP-MM: Memory Management Configurations

#
# ESP NETIF Adapter
#
# default:
CONFIG_ESP_NETIF_LOST_IP_TIMER_ENABLE=y
# default:
CONFIG_ESP_NETIF_IP_LOST_TIMER_INTERVAL=120
# default:
# CONFIG_ESP_NETIF_PROVIDE_CUSTOM_IMPLEMENTATION is not set
# default:
CONFIG_ESP_NETIF_TCPIP_LWIP=y
# default:
# CONFIG_ESP_NETIF_LOOPBACK is not set
# default:
CONFIG_ESP_NETIF_USES_TCPIP_WITH_BSD_API=y
# default:
CONFIG_ESP_NETIF_REPORT_DATA_TRAFFIC=y
# default:
CONFIG_ESP_NETIF_RECEIVE_REPORT_ERRORS=y
# default:
# CONFIG_ESP_NETIF_L2_TAP is not set
# default:
# CONFIG_ESP_NETIF_BRIDGE_EN is not set
# default:
# CONFIG_ESP_NETIF_SET_DNS_PER_DEFAULT_NETIF is not set
# end of ESP NETIF Adapter

#
# Partition API Configuration
#
# end of Partition API Configuration

#
# PHY
#
# default:
CONFIG_ESP_PHY_ENABLED=y
# default:
CONFIG_ESP_PHY_CALIBRATION_AND_DATA_STORAGE=y
# default:
# CONFIG_ESP_PHY_INIT_DATA_IN_PARTITION is not set
# default:
CONFIG_ESP_PHY_MAX_WIFI_TX_POWER=20
# default:
CONFIG_ESP_PHY_MAX_TX_POWER=20
CONFIG_ESP_PHY_REDUCE_TX_POWER=y
# default:
CONFIG_ESP_PHY_ENABLE_USB=y
CONFIG_ESP_PHY_ENABLE_CERT_TEST=y
# default:
CONFIG_ESP_PHY_RF_CAL_PARTIAL=y
# default:
# CONFIG_ESP_PHY_RF_CAL_NONE is not set
# default:
# CONFIG_ESP_PHY_RF_CAL_FULL is not set
# default:
CONFIG_ESP_PHY_CALIBRATION_MODE=0
# default:
CONFIG_ESP_PHY_PLL_TRACK_PERIOD_MS=1000
# default:
# CONFIG_ESP_PHY_PLL_TRACK_DEBUG is not set
# default:
# CONFIG_ESP_PHY_RECORD_USED_TIME is not set
# default:
CONFIG_ESP_PHY_IRAM_OPT=y
# default:
# CONFIG_ESP_PHY_DEBUG is not set
# default:
CONFIG_ESP_PHY_ENABLE_VERSION_PRINT=y
# end of PHY

#
# Power Management
#
# default:
# CONFIG_PM_SLEEP_FUNC_IN_IRAM is not set
# default:
# CONFIG_PM_ENABLE is not set
# default:
CONFIG_PM_SLP_IRAM_OPT=y
# default:
CONFIG_PM_POWER_DOWN_CPU_IN_LIGHT_SLEEP=y
# default:
CONFIG_PM_RESTORE_CACHE_TAGMEM_AFTER_LIGHT_SLEEP=y
# default:
CONFIG_PM_ESP_SLEEP_POWER_DOWN_CPU=y
# end of Power Management

#
# ESP PSRAM
#
# default:
# CONFIG_SPIRAM is not set
# end of ESP PSRAM

#
# ESP Ringbuf
#
# default:
# CONFIG_RINGBUF_IN_IRAM is not set
CONFIG_RINGBUF_PLACE_ISR_FUNCTIONS_INTO_FLASH=y
# end of ESP Ringbuf

#
# ESP-ROM
#
# default:
CONFIG_ESP_ROM_PRINT_IN_IRAM=y
# end of ESP-ROM

#
# ESP Security Specific
#
# end of ESP Security Specific

#
# ESP-STDIO
#
# default:
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
# default:
# CONFIG_ESP_CONSOLE_USB_CDC is not set
# default:
# CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG is not set
# default:
# CONFIG_ESP_CONSOLE_UART_CUSTOM is not set
# default:
# CONFIG_ESP_CONSOLE_NONE is not set
# default:
# CONFIG_ESP_CONSOLE_SECONDARY_NONE is not set
# default:
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y
# default:
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=y
# default:
CONFIG_ESP_CONSOLE_UART=y
# default:
CONFIG_ESP_CONSOLE_UART_NUM=0
# default:
CONFIG_ESP_CONSOLE_ROM_SERIAL_PORT_NUM=0
# default:
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
# end of ESP-STDIO

#
# ESP System Settings
#
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_80 is not set
# CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_160 is not set
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
# default:
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=240

#
# Cache config
#
# default:
CONFIG_ESP32S3_INSTRUCTION_CACHE_16KB=y
# default:
# CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB is not set
# default:
CONFIG_ESP32S3_INSTRUCTION_CACHE_SIZE=0x4000
# default:
# CONFIG_ESP32S3_INSTRUCTION_CACHE_4WAYS is not set
# default:
CONFIG_ESP32S3_INSTRUCTION_CACHE_8WAYS=y
# default:
CONFIG_ESP32S3_ICACHE_ASSOCIATED_WAYS=8
# default:
# CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_16B is not set
# default:
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_32B=y
# default:
CONFIG_ESP32S3_INSTRUCTION_CACHE_LINE_SIZE=32
# default:
# CONFIG_ESP32S3_DATA_CACHE_16KB is not set
# default:
CONFIG_ESP32S3_DATA_CACHE_32KB=y
# default:
# CONFIG_ESP32S3_DATA_CACHE_64KB is not set
# default:
CONFIG_ESP32S3_DATA_CACHE_SIZE=0x8000
# default:
# CONFIG_ESP32S3_DATA_CACHE_4WAYS is not set
# default:
CONFIG_ESP32S3_DATA_CACHE_8WAYS=y
# default:
CONFIG_ESP32S3_DCACHE_ASSOCIATED_WAYS=8
# default:
# CONFIG_ESP32S3_DATA_CACHE_LINE_16B is not set
# default:
CONFIG_ESP32S3_DATA_CACHE_LINE_32B=y
# default:
# CONFIG_ESP32S3_DATA_CACHE_LINE_64B is not set
# default:
CONFIG_ESP32S3_DATA_CACHE_LINE_SIZE=32
# end of Cache config

#
# Memory
#
# default:
# CONFIG_ESP32S3_RTCDATA_IN_FAST_MEM is not set
# default:
# CONFIG_ESP32S3_USE_FIXED_STATIC_RAM_SIZE is not set
# end of Memory

#
# Trace memory
#
# default:
# CONFIG_ESP32S3_TRAX is not set
# default:
CONFIG_ESP32S3_TRACEMEM_RESERVE_DRAM=0x0
# end of Trace memory

# default:
CONFIG_ESP_SYSTEM_IN_IRAM=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_PRINT_HALT is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
# default:
# CONFIG_ESP_SYSTEM_PANIC_SILENT_REBOOT is not set
# default:
# CONFIG_ESP_SYSTEM_PANIC_GDBSTUB is not set
# default:
CONFIG_ESP_SYSTEM_PANIC_REBOOT_DELAY_SECONDS=0
# default:
CONFIG_ESP_SYSTEM_RTC_FAST_MEM_AS_HEAP_DEPCHECK=y
# default:
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=y
# CONFIG_ESP_SYSTEM_MEMPROT is not set
# default:
CONFIG_ESP_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=3072
CONFIG_ESP_MAIN_TASK_STACK_SIZE=3072
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_CPU1 is not set
# default:
# CONFIG_ESP_MAIN_TASK_AFFINITY_NO_AFFINITY is not set
# default:
CONFIG_ESP_MAIN_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_MINIMAL_SHARED_STACK_SIZE=2048
# default:
CONFIG_ESP_INT_WDT=y
# default:
CONFIG_ESP_INT_WDT_TIMEOUT_MS=300
# default:
CONFIG_ESP_INT_WDT_CHECK_CPU1=y
# default:
CONFIG_ESP_TASK_WDT_EN=y
# default:
CONFIG_ESP_TASK_WDT_INIT=y
# default:
# CONFIG_ESP_TASK_WDT_PANIC is not set
# default:
CONFIG_ESP_TASK_WDT_TIMEOUT_S=5
# default:
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
# default:
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU1=y
# default:
# CONFIG_ESP_PANIC_HANDLER_IRAM is not set
# default:
# CONFIG_ESP_DEBUG_STUBS_ENABLE is not set
# default:
CONFIG_ESP_DEBUG_OCDAWARE=y
# default:
CONFIG_ESP_SYSTEM_CHECK_INT_LEVEL_4=y
# default:
CONFIG_ESP_SYSTEM_BBPLL_RECALIB=y
# end of ESP System Settings

#
# IPC (Inter-Processor Call)
#
# default:
CONFIG_ESP_IPC_ENABLE=y
# default:
CONFIG_ESP_IPC_TASK_STACK_SIZE=1280
# default:
CONFIG_ESP_IPC_USES_CALLERS_PRIORITY=y
# default:
CONFIG_ESP_IPC_ISR_ENABLE=y
# end of IPC (Inter-Processor Call)

#
# ESP Timer (High Resolution Timer)
#
# default:
CONFIG_ESP_TIMER_IN_IRAM=y
# default:
# CONFIG_ESP_TIMER_PROFILING is not set
# default:
CONFIG_ESP_TIME_FUNCS_USE_RTC_TIMER=y
# default:
CONFIG_ESP_TIME_FUNCS_USE_ESP_TIMER=y
# default:
CONFIG_ESP_TIMER_TASK_STACK_SIZE=3584
# default:
CONFIG_ESP_TIMER_INTERRUPT_LEVEL=1
# default:
# CONFIG_ESP_TIMER_SHOW_EXPERIMENTAL is not set
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY=0x0
# default:
CONFIG_ESP_TIMER_TASK_AFFINITY_CPU0=y
# default:
CONFIG_ESP_TIMER_ISR_AFFINITY_CPU0=y
# default:
# CONFIG_ESP_TIMER_SUPPORTS_ISR_DISPATCH_METHOD is not set
# default:
CONFIG_ESP_TIMER_IMPL_SYSTIMER=y
# end of ESP Timer (High Resolution Timer)

#
# ESP Trace Configuration
#
# default:
# CONFIG_ESP_TRACE_LIB_EXTERNAL is not set
# default:
CONFIG_ESP_TRACE_LIB_NONE=y
# default:
CONFIG_ESP_TRACE_LIB_NAME="none"
# default:
# CONFIG_ESP_TRACE_TRANSPORT_APPTRACE is not set
# default:
CONFIG_ESP_TRACE_TRANSPORT_NONE=y
# default:
CONFIG_ESP_TRACE_TRANSPORT_NAME="none"
# end of ESP Trace Configuration

